acaballero/etherlab/lib/ST77XX-STM32/Display_afb.cpp
    return 0;
}

void Display::setPadding(uint16_t x, uint16_t y) {
    padding_x = x;
    padding_y = y;
}

uint16_t Display::get_padding_x() { return padding_x; }

uint16_t Display::get_padding_y() { return padding_y; }

size_t Display::print(char c) { return write(c); }

size_t Display::print(unsigned char b, int base) { return print((unsigned long)b, base); }

size_t Display::print(int n, int base) { return print((long)n, base); }

size_t Display::print(unsigned int n, int base) { return print((unsigned long)n, base); }

size_t Display::print(long n, int base) {
    if (base == 0) {
        return write(n);
    } else if (base == 10) {
        if (n < 0) {
            int t = print('-');
            n = -n;
            return printNumber(n, 10) + t;
        }
        return printNumber(n, 10);
    } else {
        return printNumber(n, base);
    }
}

size_t Display::print(unsigned long n, int base) {
    if (base == 0)
        return write(n);
    else
        return printNumber(n, base);
}

size_t Display::print(double n, int digits) { return printFloat(n, digits); }

size_t Display::printNumber(unsigned long n, uint8_t base) {
    char buf[8 * sizeof(long) + 1]; // Assumes 8-bit chars plus zero byte.
    char *str = &buf[sizeof(buf) - 1];

    *str = '\0';

    // prevent crash if called with base == 1
    if (base < 2)
        base = 10;

    do {
        unsigned long m = n;
        n /= base;
        char c = m - base * n;
        *--str = c < 10 ? c + '0' : c + 'A' - 10;
    } while (n);

    return write(str);
}

size_t Display::printFloat(double number, uint8_t digits) {
    size_t n = 0;

    if (isnan(number))
        return print("nan");
    if (isinf(number))
        return print("inf");
    if (number > 4294967040.0)
        return print("ovf"); // constant determined empirically
    if (number < -4294967040.0)
        return print("ovf"); // constant determined empirically

    // Handle negative numbers
    if (number < 0.0) {
        n += print('-');
        number = -number;
    }

    // Round correctly so that print(1.999, 2) prints as "2.00"
    double rounding = 0.5;
    for (uint8_t i = 0; i < digits; ++i)
        rounding /= 10.0;

    number += rounding;

    // Extract the integer part of the number and print it
    unsigned long int_part = (unsigned long)number;
    double remainder = number - (double)int_part;
    n += print(int_part);

    // Print the decimal point, but only if there are digits beyond
    if (digits > 0) {
        n += print(".");
    }

    // Extract digits from the remainder one at a time
    while (digits-- > 0) {
        remainder *= 10.0;
        int toPrint = int(remainder);
        n += print(toPrint);
        remainder -= toPrint;
    }

    return n;
}

bool Display::getWrapText() const { return wrap_text; }

void Display::setWrapText(bool wrap_text) { Display::wrap_text = wrap_text; }
